{"title":"The Project Gutenberg EBook of Tractatus Logico-Philosophicus by Ludwig Wittgenstein","id":"1331474725126-2578184115585024","content":"<h1><h1>The Project Gutenberg EBook of Tractatus Logico-Philosophicus by Ludwig Wittgenstein</h1><div><pre>Shorter intro</pre></div></h1><div><pre>If this work has any value, it consists in two things: the first is that\nthoughts are expressed in it, and on this score the better the thoughts are\nexpressed--the more the nail has been hit on the head--the greater will be\nits value.--Here I am conscious of having fallen a long way short of what\nis possible. Simply because my powers are too slight for the accomplishment\nof the task.--May others come and do it better.\nOn the other hand the truth of the thoughts that are here communicated\nseems to me unassailable and definitive. I therefore believe myself to have\nfound, on all essential points, the final solution of the problems. And if\nI am not mistaken in this belief, then the second thing in which the of\nthis work consists is that it shows how little is achieved when these\nproblem are solved.\nL.W. Vienna, 1918\n1 The world is all that is the case.\n1.1 The world is the totality of facts, not of things.\n1.11 The world is determined by the facts, and by their being all the\nfacts.\n1.12 For the totality of facts determines what is the case, and also\nwhatever is not the case.\n1.13 The facts in logical space are the world.\n1.2 The world divides into facts.\n1.21 Each item can be the case or not the case while everything else\nremains the same.\n2 What is the case--a fact--is the existence of states of affairs.\n2.01 A state of affairs (a state of things) is a combination of objects\n(things).\n2.011 It is essential to things that they should be possible constituents\nof states of affairs.\n2.012 In logic nothing is accidental: if a thing can occur in a state of\naffairs, the possibility of the state of affairs must be written into the\nthing itself.\n2.0121 It would seem to be a sort of accident, if it turned out that a\nsituation would fit a thing that could already exist entirely on its own.\nIf things can occur in states of affairs, this possibility must be in them\nfrom the beginning. (Nothing in the province of logic can be merely\npossible. Logic deals with every possibility and all possibilities are its\nfacts.) Just as we are quite unable to imagine spatial objects outside\nspace or temporal objects outside time, so too there is no object that we\ncan imagine excluded from the possibility of combining with others. If I\ncan imagine objects combined in states of affairs, I cannot imagine them\nexcluded from the possibility of such combinations.\n2.0122 Things are independent in so far as they can occur in all possible\nsituations, but this form of independence is a form of connexion with\nstates of affairs, a form of dependence. (It is impossible for words to\nappear in two different roles: by themselves, and in propositions.)\n2.0123 If I know an object I also know all its possible occurrences in\nstates of affairs. (Every one of these possibilities must be part of the\nnature of the object.) A new possibility cannot be discovered later.\n2.01231 If I am to know an object, thought I need not know its external\nproperties, I must know all its internal properties.\n2.0124 If all objects are given, then at the same time all possible states\nof affairs are also given.\n2.013 Each thing is, as it were, in a space of possible states of affairs.\nThis space I can imagine empty, but I cannot imagine the thing without the\nspace.\n2.0131 A spatial object must be situated in infinite space. (A spatial\npoint is an argument-place.) A speck in the visual field, thought it need\nnot be red, must have some colour: it is, so to speak, surrounded by colour-\nspace. Notes must have some pitch, objects of the sense of touch some\ndegree of hardness, and so on.\n2.014 Objects contain the possibility of all situations.\n2.0141 The possibility of its occurring in states of affairs is the form of\nan object.\n2.02 Objects are simple.\n2.0201 Every statement about complexes can be resolved into a statement\nabout their constituents and into the propositions that describe the\ncomplexes completely.\n2.021 Objects make up the substance of the world. That is why they cannot\nbe composite.\n2.0211 If they world had no substance, then whether a proposition had sense\nwould depend on whether another proposition was true.\n2.0212 In that case we could not sketch any picture of the world (true or\nfalse).\n2.022 It is obvious that an imagined world, however difference it may be\nfrom the real one, must have something-- a form--in common with it.\n2.023 Objects are just what constitute this unalterable form.\n2.0231 The substance of the world can only determine a form, and not any\nmaterial properties. For it is only by means of propositions that material\nproperties are represented--only by the configuration of objects that they\nare produced.\n2.0232 In a manner of speaking, objects are colourless.\n2.0233 If two objects have the same logical form, the only distinction\nbetween them, apart from their external properties, is that they are\ndifferent.\n2.02331 Either a thing has properties that nothing else has, in which case\nwe can immediately use a description to distinguish it from the others and\nrefer to it; or, on the other hand, there are several things that have the\nwhole set of their properties in common, in which case it is quite\nimpossible to indicate one of them. For it there is nothing to distinguish\na thing, I cannot distinguish it, since otherwise it would be distinguished\nafter all.\n2.024 The substance is what subsists independently of what is the case.\n2.025 It is form and content.\n2.0251 Space, time, colour (being coloured) are forms of objects.\n2.026 There must be objects, if the world is to have unalterable form.\n2.027 Objects, the unalterable, and the subsistent are one and the same.\n2.0271 Objects are what is unalterable and subsistent; their configuration\nis what is changing and unstable.\n2.0272 The configuration of objects produces states of affairs.\n2.03 In a state of affairs objects fit into one another like the links of a\nchain.\n2.031 In a state of affairs objects stand in a determinate relation to one\nanother.\n2.032 The determinate way in which objects are connected in a state of\naffairs is the structure of the state of affairs.\n2.033 Form is the possibility of structure.\n2.034 The structure of a fact consists of the structures of states of\naffairs.\n2.04 The totality of existing states of affairs is the world.\n2.05 The totality of existing states of affairs also determines which\nstates of affairs do not exist.\n2.06 The existence and non-existence of states of affairs is reality. (We\ncall the existence of states of affairs a positive fact, and their non-\nexistence a negative fact.)\n2.061 States of affairs are independent of one another.\n2.062 From the existence or non-existence of one state of affairs it is\nimpossible to infer the existence or non-existence of another.\n2.063 The sum-total of reality is the world.\n2.1 We picture facts to ourselves.\n2.11 A picture presents a situation in logical space, the existence and non-\nexistence of states of affairs.\n2.12 A picture is a model of reality.\n2.13 In a picture objects have the elements of the picture corresponding to\nthem.\n2.131 In a picture the elements of the picture are the representatives of\nobjects.\n2.14 What constitutes a picture is that its elements are related to one\nanother in a determinate way.\n2.141 A picture is a fact.\n2.15 The fact that the elements of a picture are related to one another in\na determinate way represents that things are related to one another in the\nsame way. Let us call this connexion of its elements the structure of the\npicture, and let us call the possibility of this structure the pictorial\nform of the picture.\n2.151 Pictorial form is the possibility that things are related to one\nanother in the same way as the elements of the picture.\n2.1511 That is how a picture is attached to reality; it reaches right out\nto it.\n2.1512 It is laid against reality like a measure.\n2.15121 Only the end-points of the graduating lines actually touch the\nobject that is to be measured.\n2.1514 So a picture, conceived in this way, also includes the pictorial\nrelationship, which makes it into a picture.\n2.1515 These correlations are, as it were, the feelers of the picture's\nelements, with which the picture touches reality.\n2.16 If a fact is to be a picture, it must have something in common with\nwhat it depicts.\n2.161 There must be something identical in a picture and what it depicts,\nto enable the one to be a picture of the other at all.\n2.17 What a picture must have in common with reality, in order to be able\nto depict it--correctly or incorrectly--in the way that it does, is its\npictorial form.\n2.171 A picture can depict any reality whose form it has. A spatial picture\ncan depict anything spatial, a coloured one anything coloured, etc.\n2.172 A picture cannot, however, depict its pictorial form: it displays it.\n2.173 A picture represents its subject from a position outside it. (Its\nstandpoint is its representational form.) That is why a picture represents\nits subject correctly or incorrectly.\n2.174 A picture cannot, however, place itself outside its representational\nform.\n2.18 What any picture, of whatever form, must have in common with reality,\nin order to be able to depict it--correctly or incorrectly--in any way at\nall, is logical form, i.e. the form of reality.\n2.181 A picture whose pictorial form is logical form is called a logical\npicture.\n2.182 Every picture is at the same time a logical one. (On the other hand,\nnot every picture is, for example, a spatial one.)\n2.19 Logical pictures can depict the world.\n2.2 A picture has logico-pictorial form in common with what it depicts.\n2.201 A picture depicts reality by representing a possibility of existence\nand non-existence of states of affairs.\n2.202 A picture contains the possibility of the situation that it\nrepresents.\n2.203 A picture agrees with reality or fails to agree; it is correct or\nincorrect, true or false.\n2.22 What a picture represents it represents independently of its truth or\nfalsity, by means of its pictorial form.\n2.221 What a picture represents is its sense.\n2.222 The agreement or disagreement or its sense with reality constitutes\nits truth or falsity.\n2.223 In order to tell whether a picture is true or false we must compare\nit with reality.\n2.224 It is impossible to tell from the picture alone whether it is true or\nfalse.\n2.225 There are no pictures that are true a priori.\n3 A logical picture of facts is a thought.\n3.001 'A state of affairs is thinkable': what this means is that we can\npicture it to ourselves.\n3.01 The totality of true thoughts is a picture of the world.\n3.02 A thought contains the possibility of the situation of which it is the\nthought. What is thinkable is possible too.\n3.03 Thought can never be of anything illogical, since, if it were, we\nshould have to think illogically.\n3.031 It used to be said that God could create anything except what would\nbe contrary to the laws of logic.The truth is that we could not say what an\n'illogical' world would look like.\n3.032 It is as impossible to represent in language anything that\n'contradicts logic' as it is in geometry to represent by its coordinates a\nfigure that contradicts the laws of space, or to give the coordinates of a\npoint that does not exist.\n3.0321 Though a state of affairs that would contravene the laws of physics\ncan be represented by us spatially, one that would contravene the laws of\ngeometry cannot.\n3.04 It a thought were correct a priori, it would be a thought whose\npossibility ensured its truth.\n3.05 A priori knowledge that a thought was true would be possible only it\nits truth were recognizable from the thought itself (without anything a to\ncompare it with).\n3.1 In a proposition a thought finds an expression that can be perceived by\nthe senses.\n3.11 We use the perceptible sign of a proposition (spoken or written, etc.)\nas a projection of a possible situation. The method of projection is to\nthink of the sense of the proposition.\n3.12 I call the sign with which we express a thought a propositional\nsign.And a proposition is a propositional sign in its projective relation\nto the world.\n3.13 A proposition, therefore, does not actually contain its sense, but\ndoes contain the possibility of expressing it. ('The content of a\nproposition' means the content of a proposition that has sense.) A\nproposition contains the form, but not the content, of its sense.\n3.14 What constitutes a propositional sign is that in its elements (the\nwords) stand in a determinate relation to one another. A propositional sign\nis a fact.\n3.141 A proposition is not a blend of words.(Just as a theme in music is\nnot a blend of notes.) A proposition is articulate.\n3.142 Only facts can express a sense, a set of names cannot.\n3.143 Although a propositional sign is a fact, this is obscured by the\nusual form of expression in writing or print. For in a printed proposition,\nfor example, no essential difference is apparent between a propositional\nsign and a word. (That is what made it possible for Frege to call a\nproposition a composite name.)\n3.1431 The essence of a propositional sign is very clearly seen if we\nimagine one composed of spatial objects (such as tables, chairs, and books)\ninstead of written signs.\n3.1432 Instead of, 'The complex sign \"aRb\" says that a stands to b in the\nrelation R' we ought to put, 'That \"a\" stands to \"b\" in a certain relation\nsays that aRb.'\n3.144 Situations can be described but not given names.\n3.2 In a proposition a thought can be expressed in such a way that elements\nof the propositional sign correspond to the objects of the thought.\n3.201 I call such elements 'simple signs', and such a proposition 'complete\nanalysed'.\n3.202 The simple signs employed in propositions are called names.\n3.203 A name means an object. The object is its meaning. ('A' is the same\nsign as 'A'.)\n3.21 The configuration of objects in a situation corresponds to the\nconfiguration of simple signs in the propositional sign.\n3.221 Objects can only be named. Signs are their representatives. I can\nonly speak about them: I cannot put them into words. Propositions can only\nsay how things are, not what they are.\n3.23 The requirement that simple signs be possible is the requirement that\nsense be determinate.\n3.24 A proposition about a complex stands in an internal relation to a\nproposition about a constituent of the complex. A complex can be given only\nby its description, which will be right or wrong. A proposition that\nmentions a complex will not be nonsensical, if the complex does not exits,\nbut simply false. When a propositional element signifies a complex, this\ncan be seen from an indeterminateness in the propositions in which it\noccurs. In such cases we know that the proposition leaves something\nundetermined. (In fact the notation for generality contains a prototype.)\nThe contraction of a symbol for a complex into a simple symbol can be\nexpressed in a definition.\n3.25 A proposition cannot be dissected any further by means of a\ndefinition: it is a primitive sign.\n3.261 Every sign that has a definition signifies via the signs that serve\nto define it; and the definitions point the way. Two signs cannot signify\nin the same manner if one is primitive and the other is defined by means of\nprimitive signs. Names cannot be anatomized by means of definitions. (Nor\ncan any sign that has a meaning independently and on its own.)\n3.262 What signs fail to express, their application shows. What signs slur\nover, their application says clearly.\n3.263 The meanings of primitive signs can be explained by means of\nelucidations. Elucidations are propositions that stood if the meanings of\nthose signs are already known.\n3.3 Only propositions have sense; only in the nexus of a proposition does a\nname have meaning.\n3.31 I call any part of a proposition that characterizes its sense an\nexpression (or a symbol). (A proposition is itself an expression.)\nEverything essential to their sense that propositions can have in common\nwith one another is an expression. An expression is the mark of a form and\na content.\n3.311 An expression presupposes the forms of all the propositions in which\nit can occur. It is the common characteristic mark of a class of\npropositions.\n3.312 It is therefore presented by means of the general form of the\npropositions that it characterizes. In fact, in this form the expression\nwill be constant and everything else variable.\n3.313 Thus an expression is presented by means of a variable whose values\nare the propositions that contain the expression. (In the limiting case the\nvariable becomes a constant, the expression becomes a proposition.) I call\nsuch a variable a 'propositional variable'.\n3.314 An expression has meaning only in a proposition. All variables can be\nconstrued as propositional variables. (Even variable names.)\n3.315 If we turn a constituent of a proposition into a variable, there is a\nclass of propositions all of which are values of the resulting variable\nproposition. In general, this class too will be dependent on the meaning\nthat our arbitrary conventions have given to parts of the original\nproposition. But if all the signs in it that have arbitrarily determined\nmeanings are turned into variables, we shall still get a class of this\nkind. This one, however, is not dependent on any convention, but solely on\nthe nature of the pro position. It corresponds to a logical form--a logical\nprototype.\n3.316 What values a propositional variable may take is something that is\nstipulated. The stipulation of values is the variable.\n3.317 To stipulate values for a propositional variable is to give the\npropositions whose common characteristic the variable is. The stipulation\nis a description of those propositions. The stipulation will therefore be\nconcerned only with symbols, not with their meaning. And the only thing\nessential to the stipulation is that it is merely a description of symbols\nand states nothing about what is signified. How the description of the\npropositions is produced is not essential.\n3.318 Like Frege and Russell I construe a proposition as a function of the\nexpressions contained in it.\n3.32 A sign is what can be perceived of a symbol.\n3.321 So one and the same sign (written or spoken, etc.) can be common to\ntwo different symbols--in which case they will signify in different ways.\n3.322 Our use of the same sign to signify two different objects can never\nindicate a common characteristic of the two, if we use it with two\ndifferent modes of signification. For the sign, of course, is arbitrary. So\nwe could choose two different signs instead, and then what would be left in\ncommon on the signifying side?\n3.323 In everyday language it very frequently happens that the same word\nhas different modes of signification--and so belongs to different symbols--\nor that two words that have different modes of signification are employed\nin propositions in what is superficially the same way. Thus the word 'is'\nfigures as the copula, as a sign for identity, and as an expression for\nexistence; 'exist' figures as an intransitive verb like 'go', and\n'identical' as an adjective; we speak of something, but also of something's\nhappening. (In the proposition, 'Green is green'--where the first word is\nthe proper name of a person and the last an adjective--these words do not\nmerely have different meanings: they are different symbols.)\n3.324 In this way the most fundamental confusions are easily produced (the\nwhole of philosophy is full of them).\n3.325 In order to avoid such errors we must make use of a sign-language\nthat excludes them by not using the same sign for different symbols and by\nnot using in a superficially similar way signs that have different modes of\nsignification: that is to say, a sign-language that is governed by logical\ngrammar--by logical syntax. (The conceptual notation of Frege and Russell\nis such a language, though, it is true, it fails to exclude all mistakes.)\n3.326 In order to recognize a symbol by its sign we must observe how it is\nused with a sense.\n3.327 A sign does not determine a logical form unless it is taken together\nwith its logico-syntactical employment.\n3.328 If a sign is useless, it is meaningless. That is the point of Occam's\nmaxim. (If everything behaves as if a sign had meaning, then it does have\nmeaning.)\n3.33 In logical syntax the meaning of a sign should never play a role. It\nmust be possible to establish logical syntax without mentioning the meaning\nof a sign: only the description of expressions may be presupposed.\n3.331 From this observation we turn to Russell's 'theory of types'. It can\nbe seen that Russell must be wrong, because he had to mention the meaning\nof signs when establishing the rules for them.\n3.332 No proposition can make a statement about itself, because a\npropositional sign cannot be contained in itself (that is the whole of the\n'theory of types').\n3.333 The reason why a function cannot be its own argument is that the sign\nfor a function already contains the prototype of its argument, and it\ncannot contain itself. For let us suppose that the function F(fx) could be\nits own argument: in that case there would be a proposition 'F(F(fx))', in\nwhich the outer function F and the inner function F must have different\nmeanings, since the inner one has the form O(f(x)) and the outer one has\nthe form Y(O(fx)). Only the letter 'F' is common to the two functions, but\nthe letter by itself signifies nothing. This immediately becomes clear if\ninstead of 'F(Fu)' we write '(do) : F(Ou) . Ou = Fu'. That disposes of\nRussell's paradox.\n3.334 The rules of logical syntax must go without saying, once we know how\neach individual sign signifies.\n3.34 A proposition possesses essential and accidental features. Accidental\nfeatures are those that result from the particular way in which the\npropositional sign is produced. Essential features are those without which\nthe proposition could not express its sense.\n3.341 So what is essential in a proposition is what all propositions that\ncan express the same sense have in common. And similarly, in general, what\nis essential in a symbol is what all symbols that can serve the same\npurpose have in common.\n3.3411 So one could say that the real name of an object was what all\nsymbols that signified it had in common. Thus, one by one, all kinds of\ncomposition would prove to be unessential to a name.\n3.342 Although there is something arbitrary in our notations, this much is\nnot arbitrary--that when we have determined one thing arbitrarily,\nsomething else is necessarily the case. (This derives from the essence of\nnotation.)\n3.3421 A particular mode of signifying may be unimportant but it is always\nimportant that it is a possible mode of signifying. And that is generally\nso in philosophy: again and again the individual case turns out to be\nunimportant, but the possibility of each individual case discloses\nsomething about the essence of the world.\n3.343 Definitions are rules for translating from one language into another.\nAny correct sign-language must be translatable into any other in accordance\nwith such rules: it is this that they all have in common.\n3.344 What signifies in a symbol is what is common to all the symbols that\nthe rules of logical syntax allow us to substitute for it.\n3.3441 For instance, we can express what is common to all notations for\ntruth-functions in the following way: they have in common that, for\nexample, the notation that uses 'Pp' ('not p') and 'p C g' ('p or g') can\nbe substituted for any of them. (This serves to characterize the way in\nwhich something general can be disclosed by the possibility of a specific\nnotation.)\n3.3442 Nor does analysis resolve the sign for a complex in an arbitrary\nway, so that it would have a different resolution every time that it was\nincorporated in a different proposition.\n3.4 A proposition determines a place in logical space. The existence of\nthis logical place is guaranteed by the mere existence of the constituents--\nby the existence of the proposition with a sense.\n3.41 The propositional sign with logical co-ordinates--that is the logical\nplace.\n3.411 In geometry and logic alike a place is a possibility: something can\nexist in it.\n3.42 A proposition can determine only one place in logical space:\nnevertheless the whole of logical space must already be given by it.\n(Otherwise negation, logical sum, logical product, etc., would introduce\nmore and more new elements in co-ordination.) (The logical scaffolding\nsurrounding a picture determines logical space. The force of a proposition\nreaches through the whole of logical space.)\n3.5 A propositional sign, applied and thought out, is a thought.\n4 A thought is a proposition with a sense.\n4.001 The totality of propositions is language.\n4.022 Man possesses the ability to construct languages capable of\nexpressing every sense, without having any idea how each word has meaning\nor what its meaning is--just as people speak without knowing how the\nindividual sounds are produced. Everyday language is a part of the human\norganism and is no less complicated than it. It is not humanly possible to\ngather immediately from it what the logic of language is. Language\ndisguises thought. So much so, that from the outward form of the clothing\nit is impossible to infer the form of the thought beneath it, because the\noutward form of the clothing is not designed to reveal the form of the\nbody, but for entirely different purposes. The tacit conventions on which\nthe understanding of everyday language depends are enormously complicated.</pre><a></a><span>4.003 Most of the propositions and questions to be found in philosophical works are not false but nonsensical. Consequently we cannot give any answer to questions of this kind, but can only point out that they are nonsensical. Most of the propositions and questions of philosophers arise from our failure to understand the logic of our language. (They belong to the same class as the question whether the good is more or less identical than the beautiful.) And it is not surprising that the deepest problems are in fact not problems at all.</span><p>4.0031 All philosophy is a 'critique of language' (though not in Mauthner's sense). It was Russell who performed the service of showing that the apparent logical form of a proposition need not be its real one.</p>\n<pre>4.01 A proposition is a picture of reality. A proposition is a model of\nreality as we imagine it.\n4.011 At first sight a proposition--one set out on the printed page, for\nexample--does not seem to be a picture of the reality with which it is\nconcerned. But neither do written notes seem at first sight to be a picture\nof a piece of music, nor our phonetic notation (the alphabet) to be a\npicture of our speech. And yet these sign-languages prove to be pictures,\neven in the ordinary sense, of what they represent.\n4.012 It is obvious that a proposition of the form 'aRb' strikes us as a\npicture. In this case the sign is obviously a likeness of what is\nsignified.\n4.013 And if we penetrate to the essence of this pictorial character, we\nsee that it is not impaired by apparent irregularities (such as the use\n[sharp] of and [flat] in musical notation). For even these irregularities\ndepict what they are intended to express; only they do it in a different\nway.\n4.014 A gramophone record, the musical idea, the written notes, and the\nsound-waves, all stand to one another in the same internal relation of\ndepicting that holds between language and the world. They are all\nconstructed according to a common logical pattern. (Like the two youths in\nthe fairy-tale, their two horses, and their lilies. They are all in a\ncertain sense one.)\n4.0141 There is a general rule by means of which the musician can obtain\nthe symphony from the score, and which makes it possible to derive the\nsymphony from the groove on the gramophone record, and, using the first\nrule, to derive the score again. That is what constitutes the inner\nsimilarity between these things which seem to be constructed in such\nentirely different ways. And that rule is the law of projection which\nprojects the symphony into the language of musical notation. It is the rule\nfor translating this language into the language of gramophone records.\n4.015 The possibility of all imagery, of all our pictorial modes of\nexpression, is contained in the logic of depiction.\n4.016 In order to understand the essential nature of a proposition, we\nshould consider hieroglyphic script, which depicts the facts that it\ndescribes. And alphabetic script developed out of it without losing what\nwas essential to depiction.\n4.02 We can see this from the fact that we understand the sense of a\npropositional sign without its having been explained to us.&nbsp;\n</pre></div>  ","summary":"Shorter intro","filename":"The_Project_Gutenberg_EBook_of_Tractatus_Logico_Philosophicus_by_Ludwig_Wittgenstein"}