{"title":"JS1K 2010 Entry","id":"1331429826004-288237398523904","content":"<h2>JS1K 2010 Entry</h2>\n<div>See my entry in the 2010 JS1k demo competition. Oldskool effects in HTML5.</div><div>Click here for <a href=\"/content/demos/js1k2010.html\" title=\"Link to the a live version of the demo\">a live version of the demo</a>.  <br></div><div>JS1K is an online competition where the goal is to produce the most interesting computer program. The competition gets its name from the two defining limitations that it puts on the submissions. First the computer program has to be written in JavaScript. Second it cannot be longer than 1024 characters. Besides the size of the program, there are some more limiting rules to the competition, for example you cannot download any further files from the internet and the computer program has to work with a given set of web browsers. </div><div>My contribution to his competition marks my return to 'demo programming' after almost 22 years. I programmed my last demo in 1988, when I was in high school, in assembly language on a Commodore 64.</div>\n<div><iframe  height=\"247\" src=\"http://www.youtube.com/embed/3_KxeLWgKgs?rel=0\" frameborder=\"0\"></iframe></div><div>The competition promotes the use of newer browser features like the canvas element which allows the programmer to draw things on a two dimensional service. I used the canvas element to render a set of old school effects, typically found in Commodore 64 demos from the mid 1980s:<br><ul><li>A starfield: 600 stars flying towards you, much like in the classic Microsoft Windows Starfield screensaver.</li><li>Line interference effect: 300 diagonal lines with end points moving along a sinus curve produce a interference effect</li><li>A large swinging JS1K logo</li><li>A sinus scroller showing the source code of the program. (Some people say this makes the program a quine, but that is not correct as for a quine it's source code is it's only output.)</li><li>Not really an old school feature (but it consumed some of the 1024 characters): the canvas is centered when the browser window is resized.</li></ul></div><div>Link to the actual entry in the competition: <a href=\"http://js1k.com/2010-first/demo/431\" title=\"live version of the demo.\">http://js1k.com/2010-first/demo/431</a></div>","summary":"See my entry in the 2010 JS1k demo competition. Oldskool effects in HTML5.","filename":"JS1K_2010_Entry","lastupdate":"1333058179612","datetime":"1332023183649"}