{"title":"JS1K 2012 Entry","id":"1332026919803-4709982725472256","content":"<h2>JS1K 2012 Entry</h2>\n<div>Watch my JS1K 2012 (Love) demo competition submission: virtually infinite neoplasticism art, in 980 characters of JavaScript.</div>\n<div>Click here for <a href=\"/content/demos/js1k2012.html\" title=\"Link to the a live version of the demo\">a live version of the demo</a>.</div><div>The demo is an exploration into neoplasticism: what is and what is not acceptable as neoplasticism art, where are the edges? In the end we are left with more questions than we started out with.  Does neoplasticism have a surprisingly low Kolmogorov complexity? Was neoplasticism art inevitable and, if so, why are there no earlier examples? How hard would it be to write a program that would pass a neoplasticism-turing Test?</div><div>Initially the plan was to write something that would only generate Mondriaan  paintings from the 1919 - 1943 period. Looking at this turned out to be pretty boring after a few minutes. Actually, a very early version of the algorithm generated much more interesting work. That version got submitted to the competition.   </div><div>Consider the following two paintings the one on the left is from Piet Mondriaan, the one on the right is from Alexander Calder.<br></div><div><img src=\"/content/demos/mondriaancalder.jpg\" alt=\"Alt text here\" ><br></div><div>The following images were produced by the demo:</div><div><img src=\"/content/demos/js1k20122.png\" alt=\"Alt text here\" ><br></div><div><img src=\"/content/demos/js1k20123.png\" alt=\"Alt text here\" ><br></div><div>In case your browser cannot render the <a href=\"/content/demos/js1k2012.html\">live version</a> of the demo we uploaded a few minutes of screen capture to youtube:</div>\n<iframe  height=\"247\" src=\"http://www.youtube.com/embed/OR142DEuWnI?rel=0\" frameborder=\"0\"></iframe><div>Link to the actual entry in the competition: <a href=\"http://js1k.com/2012-love/demo/1154\" title=\"live version of the demo.\">http://js1k.com/2012-love/demo/1154</a></div>","summary":"Watch my JS1K 2012 (Love) demo competition submission: virtually infinite neoplasticism art, in 980 characters of JavaScript.","filename":"JS1K_2012_Entry","lastupdate":"1333056862784","datetime":"1332285883175"}